devdnl/dnx-rtos/src/system/drivers/ethmac/stm32f1/ethmac.c
                                                *rdcnt += pkt_size;
                                        } else {
                                                break;
                                        }
                                }

                                sys_mutex_unlock(hdl->rx_access);

                                return ESUCC;
                        } else {
                                return EAGAIN;
                        }
                } else {
                        return EINVAL;
                }
        } else {
                return EIO;
        }
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(ETHMAC, void *device_handle, int request, void *arg)
{
        struct ethmac *hdl = device_handle;

        int status;

        switch (request) {
        case IOCTL_ETHMAC__WAIT_FOR_PACKET:

                if (arg) {
                        ETHMAC_packet_wait_t *pw = reinterpret_cast(ETHMAC_packet_wait_t*, arg);
                        pw->pkt_size = wait_for_packet(hdl, pw->timeout);
                        return ESUCC;
                } else {
                        return EINVAL;
                }
                break;

        case IOCTL_ETHMAC__SET_MAC_ADDR:
                if (arg) {
                        ETH_MACAddressConfig(ETH_MAC_Address0, arg);
                        return ESUCC;
                } else {
                        return EINVAL;
                }
                break;

        case IOCTL_ETHMAC__SEND_PACKET_FROM_CHAIN:
                if (arg) {
                        if (sys_mutex_lock(hdl->tx_access, MAX_DELAY_MS) == ESUCC) {
                                ETHMAC_packet_chain_t *pkt = reinterpret_cast(ETHMAC_packet_chain_t*, arg);

                                while (is_buffer_owned_by_DMA(DMATxDescToSet)) {
                                        sys_sleep_ms(1);
                                }

                                if (  !is_buffer_owned_by_DMA(DMATxDescToSet)
                                   && pkt->payload
                                   && pkt->payload_size
                                   && pkt->total_size > 0
                                   && pkt->total_size <= ETH_MAX_PACKET_SIZE) {

                                        u8_t  *buffer = get_buffer_address(DMATxDescToSet);
                                        size_t offset = 0;

                                        for (ETHMAC_packet_chain_t *p = pkt; p != NULL; p = p->next) {
                                                memcpy(&buffer[offset], p->payload, p->payload_size);
                                                offset += p->payload_size;
                                        }

                                        send_packet(pkt->total_size);

                                        status = ESUCC;
                                } else {
                                        status = EAGAIN;
                                }

                                sys_mutex_unlock(hdl->tx_access);
                        } else {
                                status = EAGAIN;
                        }
                } else {
                        status = EINVAL;
                }
                break;

        case IOCTL_ETHMAC__RECEIVE_PACKET_TO_CHAIN:
                if (arg) {
                        if (sys_mutex_lock(hdl->rx_access, MAX_DELAY_MS) == ESUCC) {
                                ETHMAC_packet_chain_t *pkt = reinterpret_cast(ETHMAC_packet_chain_t*, arg);

                                if (  pkt->payload
                                   && pkt->payload_size
                                   && pkt->total_size > 0
                                   && pkt->total_size <= ETH_MAX_PACKET_SIZE) {

                                        if (is_buffer_owned_by_DMA(DMARxDescToGet)) {
                                                pkt->total_size = 0;

                                        } else if (ETH_GetRxPktSize() > 0) {

                                                u8_t  *buffer = get_buffer_address(DMARxDescToGet);
                                                size_t offset = 0;

                                                for (ETHMAC_packet_chain_t *p = pkt; p != NULL; p = p->next) {
                                                        memcpy(p->payload, &buffer[offset], p->payload_size);
                                                        offset += p->payload_size;
                                                }

                                                give_Rx_buffer_to_DMA();

                                                pkt->total_size = offset;
                                        } else {
                                                give_Rx_buffer_to_DMA();
                                                pkt->total_size = 0;
                                        }

                                        make_Rx_buffer_available();

                                        status = ESUCC;
                                } else {
                                        status = EINVAL;
                                }

                                sys_mutex_unlock(hdl->rx_access);
                        } else {
                                status = EAGAIN;
                        }
                } else {
                        status = EINVAL;
                }
                break;

        case IOCTL_ETHMAC__ETHERNET_START:
                ETH_Start();
                return ESUCC;

        case IOCTL_ETHMAC__ETHERNET_STOP:
                ETH_Stop();
                return ESUCC;

        case IOCTL_ETHMAC__GET_LINK_STATUS:
                if (arg) {
                        ETHMAC_link_status_t *linkstat = cast(ETHMAC_link_status_t*, arg);

                        if (ETH_ReadPHYRegister(ETHMAC_PHY_ADDRESS, PHY_BSR) & PHY_BSR_LINK_STATUS) {
                                *linkstat = ETHMAC_LINK_STATUS__CONNECTED;
                        } else {
                                *linkstat = ETHMAC_LINK_STATUS__DISCONNECTED;
                        }

                        return ESUCC;
                } else {
                        return EINVAL;
                }

        default:
                return EBADRQC;
        }

